# ==================== 导入模块 ====================
# ==================== 大    厅 ====================
def main():
    print('=' * 20 +'欢迎来到斗地主游戏！'+ '=' * 20)
    while True:
        print('1.开始游戏')
        print('2.退出游戏')
        command = input('请输入命令（1/2）：')
        if command == '1':
            print('游戏开始！')
            break
        elif command == '2':
            print('退出游戏，感谢您的参与！')
            break
        else:
            print('无效命令，请重新输入。')
    # 这里可以添加更多的游戏逻辑
# ==================== 游    戏 ====================
def game():
    pass




# ==================== 运    行 ====================
if __name__ == '__main__':
    main()