# ==================== 导入模块 ====================
import torch
# ==================== 7.1.1 气温与是否出门 ====================
# sigmoid(x)= 1/1+e^-x
# ==================== 7.1.2 给sigmoid函数增加缩放参数 ====================
# sigmoid(wx)=1/1+e^-wx
# ==================== 7.1.4 给sigmoid函数增加平移参数 ====================
# sigmoid(wx+b) = 1/1+e^-(wx+b)
# ==================== 7.1.5 一元逻辑回归的假设函数 ====================
# LogisticRegssion(x) = Sigmoid(wx+b) = 1/1+e^-(wx+b)
# ==================== 7.1.6 逻辑回归的预测 ====================
# 逻辑回归模型输出值为 0-1 之间的概率，通过设定决策临界值，将概率转化为具体类别（正例/负例），完成预测任务。
# ==================== 7.1.6 对一元逻辑回归的理解 ====================
# 一元逻辑回归本质是先对输入特征做线性回归变换，再通过 Sigmoid 激活函数进行非线性转换，最终输出 0-1 之间的概率值用于分类